IdeaRS.OpenModel.Result.ResultType
Type of results

IdeaRS.OpenModel.Result.ResultType.InternalForces
Internal forces

IdeaRS.OpenModel.Result.ResultType.Deformation
Deformation

IdeaRS.OpenModel.Result.ResultType.CrossSectionNLA
NLA on cross-section

IdeaRS.OpenModel.Result.ResultType.CrossSectionTA
TA on cross-section

IdeaRS.OpenModel.Result.ResultType.InteractionDiagram
Interaction digaram on section